Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME53_DFP/3.1.31/edc/ATSAME53J20A.PIC
      <edc:AdjustPoint edc:_addr="0x41020008" edc:offset="0x7"/>
      <edc:SFRDef edc:_addr="0x4102000F" edc:access="------nn" edc:cname="DBGCTRL" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="RAMECC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RAMECC">
            <edc:SFRFieldDef edc:cname="ECCDIS" edc:desc="ECC Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECCELOG" edc:desc="ECC Error Log" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x42000000" edc:endaddr="0x42003818" edc:regionid="HPB2">
      <edc:AdjustPoint edc:_addr="0x42000000" edc:offset="0x800"/>
      <edc:SFRDef edc:_addr="0x42000800" edc:access="------------nnnnn--nnnnnnnnnnnn-" edc:cname="NCR" edc:impl="0xF9FFE" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LBL" edc:desc="Loop Back Local" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXEN" edc:desc="Receive Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:desc="Transmit Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MPE" edc:desc="Management Port Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLRSTAT" edc:desc="Clear Statistics Registers" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INCSTAT" edc:desc="Increment Statistics Registers" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WESTAT" edc:desc="Write Enable for Statistics Registers" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BP" edc:desc="Back pressure" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSTART" edc:desc="Start Transmission" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="THALT" edc:desc="Transmit Halt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXPF" edc:desc="Transmit Pause Frame" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXZQPF" edc:desc="Transmit Zero Quantum Pause Frame" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SRTSM" edc:desc="Store Receive Time Stamp to Memory" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENPBPR" edc:desc="Enable PFC Priority-based Pause Reception" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXPBPF" edc:desc="Transmit PFC Priority-based Pause Frame" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FNP" edc:desc="Flush Next Packet" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LPI" edc:desc="Low Power Idle Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000804" edc:access="-nnn-nnnnnnnnnnnnnnn---nnnnnnnnn" edc:cname="NCFGR" edc:impl="0x77FFF1FF" edc:mclr="00000000000010000000000000000000" edc:nzwidth="0x20" edc:por="00000000000010000000000000000000" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="SPD" edc:desc="Speed" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FD" edc:desc="Full Duplex" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DNVLAN" edc:desc="Discard Non-VLAN FRAMES" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="JFRAME" edc:desc="Jumbo Frame Size" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAF" edc:desc="Copy All Frames" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NBC" edc:desc="No Broadcast" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MTIHEN" edc:desc="Multicast Hash Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNIHEN" edc:desc="Unicast Hash Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MAXFS" edc:desc="1536 Maximum Frame Size" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RTY" edc:desc="Retry Test" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEN" edc:desc="Pause Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFO" edc:desc="Receive Buffer Offset" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="LFERD" edc:desc="Length Field Error Frame Discard" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RFCS" edc:desc="Remove FCS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLK" edc:desc="MDC CLock Division" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="DBW" edc:desc="Data Bus Width" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="DCPF" edc:desc="Disable Copy of Pause Frames" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXCOEN" edc:desc="Receive Checksum Offload Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EFRHD" edc:desc="Enable Frames Received in Half Duplex" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IRXFCS" edc:desc="Ignore RX FCS" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="IPGSEN" edc:desc="IP Stretch Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBP" edc:desc="Receive Bad Preamble" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IRXER" edc:desc="Ignore IPG GRXER" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000808" edc:access="-----------------------------rr-" edc:cname="NSR" edc:impl="0x6" edc:mclr="00000000000000000000000000000100" edc:nzwidth="0x20" edc:por="00000000000000000000000000000100" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MDIO" edc:desc="MDIO Input Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IDLE" edc:desc="PHY Management Logic Idle" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200080C" edc:access="-------------------------------n" edc:cname="UR" edc:impl="0x1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="MII" edc:desc="MII Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000810" edc:access="-------nnnnnnnnn----nnnnnn-nnnnn" edc:cname="DCFGR" edc:impl="0x1FF0FDF" edc:mclr="00000000000000100000011100000100" edc:nzwidth="0x20" edc:por="00000000000000100000011100000100" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="FBLDO" edc:desc="Fixed Burst Length for DMA Data Operations:" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ESMA" edc:desc="Endian Swap Mode Enable for Management Descriptor Accesses" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ESPA" edc:desc="Endian Swap Mode Enable for Packet Data Accesses" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBMS" edc:desc="Receiver Packet Buffer Memory Size Select" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="TXPBMS" edc:desc="Transmitter Packet Buffer Memory Size Select" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCOEN" edc:desc="Transmitter Checksum Generation Offload Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DRBS" edc:desc="DMA Receive Buffer Size" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="DDRP" edc:desc="DMA Discard Receive Packets" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000814" edc:access="-----------------------n-nnnnnnn" edc:cname="TSR" edc:impl="0x17F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="UBR" edc:desc="Used Bit Read" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COL" edc:desc="Collision Occurred" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RLE" edc:desc="Retry Limit Exceeded" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXGO" edc:desc="Transmit Go" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:desc="Transmit Frame Corruption Due to AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UND" edc:desc="Transmit Underrun" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000818" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="RBQB" edc:impl="0xFFFFFFFC" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Receive Buffer Queue Base Address" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200081C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="TBQB" edc:impl="0xFFFFFFFC" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Transmit Buffer Queue Base Address" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
