Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME53_DFP/3.1.31/edc/ATSAME53J20A.PIC
      <edc:SFRDef edc:_addr="0x42000820" edc:access="----------------------------nnnn" edc:cname="RSR" edc:impl="0xF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="BNA" edc:desc="Buffer Not Available" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REC" edc:desc="Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HNO" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000824" edc:access="--nn-nnnnnnnnn---nnnnn--nnnnnnnn" edc:cname="ISR" edc:impl="0x37FC7CFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="MFS" edc:desc="Management Frame Sent" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:desc="Receive Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:desc="RX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXUBR" edc:desc="TX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TUR" edc:desc="Transmit Underrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:desc="Retry Limit Exceeded" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:desc="Transmit Frame Corruption Due to AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFNZ" edc:desc="Pause Frame with Non-zero Pause Quantum Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTZ" edc:desc="Pause Time Zero" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFTR" edc:desc="Pause Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRQFR" edc:desc="PTP Delay Request Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SFR" edc:desc="PTP Sync Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRQFT" edc:desc="PTP Delay Request Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SFT" edc:desc="PTP Sync Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRQFR" edc:desc="PDelay Request Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRSFR" edc:desc="PDelay Response Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRQFT" edc:desc="PDelay Request Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRSFT" edc:desc="PDelay Response Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SRI" edc:desc="TSU Seconds Register Increment" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WOL" edc:desc="Wake On LAN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSUCMP" edc:desc="Tsu timer comparison" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000828" edc:access="--ww-wwwwwwwww--wwwwww--wwwwwwww" edc:cname="IER" edc:impl="0x37FCFCFF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="MFS" edc:desc="Management Frame Sent" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:desc="Receive Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:desc="RX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXUBR" edc:desc="TX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TUR" edc:desc="Transmit Underrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:desc="Retry Limit Exceeded or Late Collision" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:desc="Transmit Frame Corruption Due to AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFNZ" edc:desc="Pause Frame with Non-zero Pause Quantum Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTZ" edc:desc="Pause Time Zero" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFTR" edc:desc="Pause Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXINT" edc:desc="External Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DRQFR" edc:desc="PTP Delay Request Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SFR" edc:desc="PTP Sync Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRQFT" edc:desc="PTP Delay Request Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SFT" edc:desc="PTP Sync Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRQFR" edc:desc="PDelay Request Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRSFR" edc:desc="PDelay Response Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRQFT" edc:desc="PDelay Request Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRSFT" edc:desc="PDelay Response Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SRI" edc:desc="TSU Seconds Register Increment" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WOL" edc:desc="Wake On LAN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSUCMP" edc:desc="Tsu timer comparison" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200082C" edc:access="--ww-wwwwwwwww--wwwwww--wwwwwwww" edc:cname="IDR" edc:impl="0x37FCFCFF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="MFS" edc:desc="Management Frame Sent" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:desc="Receive Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:desc="RX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXUBR" edc:desc="TX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TUR" edc:desc="Transmit Underrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:desc="Retry Limit Exceeded or Late Collision" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:desc="Transmit Frame Corruption Due to AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFNZ" edc:desc="Pause Frame with Non-zero Pause Quantum Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTZ" edc:desc="Pause Time Zero" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFTR" edc:desc="Pause Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXINT" edc:desc="External Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DRQFR" edc:desc="PTP Delay Request Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SFR" edc:desc="PTP Sync Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRQFT" edc:desc="PTP Delay Request Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SFT" edc:desc="PTP Sync Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRQFR" edc:desc="PDelay Request Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRSFR" edc:desc="PDelay Response Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRQFT" edc:desc="PDelay Request Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRSFT" edc:desc="PDelay Response Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SRI" edc:desc="TSU Seconds Register Increment" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WOL" edc:desc="Wake On LAN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSUCMP" edc:desc="Tsu timer comparison" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000830" edc:access="--rr-rrrrrrrrr--rrrrrr--rrrrrrrr" edc:cname="IMR" edc:impl="0x37FCFCFF" edc:mclr="00111111111111111111111111111111" edc:nzwidth="0x20" edc:por="00111111111111111111111111111111" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="MFS" edc:desc="Management Frame Sent" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:desc="Receive Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:desc="RX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXUBR" edc:desc="TX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TUR" edc:desc="Transmit Underrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:desc="Retry Limit Exceeded" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:desc="Transmit Frame Corruption Due to AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFNZ" edc:desc="Pause Frame with Non-zero Pause Quantum Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTZ" edc:desc="Pause Time Zero" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFTR" edc:desc="Pause Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXINT" edc:desc="External Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DRQFR" edc:desc="PTP Delay Request Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SFR" edc:desc="PTP Sync Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRQFT" edc:desc="PTP Delay Request Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SFT" edc:desc="PTP Sync Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRQFR" edc:desc="PDelay Request Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRSFR" edc:desc="PDelay Response Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRQFT" edc:desc="PDelay Request Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRSFT" edc:desc="PDelay Response Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SRI" edc:desc="TSU Seconds Register Increment" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WOL" edc:desc="Wake On Lan" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSUCMP" edc:desc="Tsu timer comparison" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000834" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MAN" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="PHY Data" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="WTN" edc:desc="Write Ten" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="REGA" edc:desc="Register Address" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="PHYA" edc:desc="PHY Address" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="OP" edc:desc="Operation" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CLTTO" edc:desc="Clause 22 Operation" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WZO" edc:desc="Write ZERO" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000838" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="RPQ" edc:impl="0xFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="RPQ" edc:desc="Received Pause Quantum" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
